{
    "flashcards": [
        {
          "id": 1,
          "title": "TCP Protocol",
          "category": "Networking",
          "content": "TCP establishes connections between devices before forwarding traffic. It ensures reliable and ordered delivery of segments while controlling data flow to manage limited resources."
        },
        {
          "id": 2,
          "title": "UDP Protocol",
          "category": "Networking",
          "content": "UDP reconstructs data in received order without resending lost segments. It operates without session establishment or informing the sender about resource availability."
        },
        {
          "id": 3,
          "title": "Presentation Layer Functions",
          "category": "Networking",
          "content": "The presentation layer formats, compresses, and encrypts data for transmission. It sets standards for file formats like video (MKV, MPG, MOV) and image formats (GIF, JPG, PNG)."
        },
        {
          "id": 4,
          "title": "Client/Server Model",
          "category": "Networking",
          "content": "The client/server model involves clients requesting data from servers. Application layer protocols define request/response formats, handling data transfer, authentication, and file identification."
        },
        {
          "id": 5,
          "title": "P2P Applications",
          "category": "Networking",
          "content": "P2P allows devices to act as both clients and servers. Some use a hybrid system where resource sharing is decentralized, but resource location indexes are stored centrally."
        },
        {
          "id": 6,
          "title": "Session Establishment in TCP",
          "category": "Networking",
          "content": "TCP negotiates and establishes a permanent connection (session) between devices. This allows managing traffic volume and closely controlling communication data."
        },
        {
          "id": 7,
          "title": "Reliable Delivery in TCP",
          "category": "Networking",
          "content": "TCP ensures that each sent segment arrives at the destination by managing segment reliability, preventing corruption, and handling lost segments."
        },
        {
          "id": 8,
          "title": "Same-Order Delivery in TCP",
          "category": "Networking",
          "content": "TCP orders and numbers segments to ensure reassembly in the correct order, avoiding issues caused by different transmission rates across networks."
        },
        {
          "id": 9,
          "title": "Flow Control in TCP",
          "category": "Networking",
          "content": "TCP regulates data flow between hosts by managing data transmission rates, preventing overwhelming of receiving host resources and the need for data retransmission."
        },
        {
          "id": 10,
          "title": "UDP Statelessness",
          "category": "Networking",
          "content": "UDP operates as a stateless protocol, where neither client nor server tracks communication session state. Reliability, if needed, must be handled at the application level."
        },
        {
          "id": 11,
          "title": "TCP/IP Layers",
          "category": "Networking",
          "content": "TCP/IP consists of multiple layers each performing specific functions. TCP operates on the transport layer, providing services like segmentation, reassembly, reliability, and flow control."
        },
        {
          "id": 12,
          "title": "UDP Datagram Transmission",
          "category": "Networking",
          "content": "UDP sends datagrams as best efforts without ensuring reliable delivery. Lost segments are not resent, and the protocol focuses on quick data transmission suitable for live video and voice applications."
        },
        {
          "id": 13,
          "title": "P2P Hybrid Systems",
          "category": "Networking",
          "content": "Some P2P systems use hybrid setups, combining decentralized resource sharing with a centralized directory storing resource location indexes."
        },
        {
          "id": 14,
          "title": "Presentation Layer Encryption",
          "category": "Networking",
          "content": "The presentation layer encrypts data for secure transmission. It handles data formatting, compression, and encryption, ensuring compatibility between source and destination devices."
        },
        {
          "id": 15,
          "title": "Client/Server Data Transfer",
          "category": "Networking",
          "content": "In client/server networks, data transfers occur between clients requesting data and servers responding to these requests. The application layer protocols manage these exchanges."
        }
      ]
    } 